import random

class NicknameGenerator:

    def __init__(self):
        self.adjectives = [
            '빠른', '힘찬', '시원한', '역동적인', '물결치는', '고요한', '활기찬', '가벼운', '은빛', '푸른',
            '아쿠아', '해양', '유연한', '민첩한', '시원한', '투명한', '반짝이는', '상쾌한', '신비한', '차가운',
            '정복하는', '돌진하는', '자유로운', '미끄러지는', '힘있는', '조용한', '빛나는', '깊은', '넓은', '무한한',
            '신속한', '경쾌한', '흐르는', '떠다니는', '웅장한', '평온한', '부드러운', '전설적인', '환상적인', '짜릿한',
            '우아한', '거침없는', '용감한', '넘실대는', '반사하는', '맑은', '차가운', '깊은', '푸른', '은밀한',
            '거대한', '영롱한', '생기넘치는', '날렵한', '강력한', '가뿐한', '매혹적인', '시원한', '쾌활한', '활기찬',
            '싱그러운', '상쾌한', '기품있는', '고요한', '수려한', '평화로운', '아름다운', '멋진', '아름다운', '눈부신',
            '경이로운', '미래적인', '스마트한', '빛의', '숨막히는', '경이로운', '신비한', '고요한', '힘있는', '새로운',
            '환희로운', '행복한', '짜릿한', '쾌속의', '무결점의', '숨겨진', '웅장한', '깊은', '푸른', '신비한',
            '역동적인', '물방울', '바다', '아쿠아', '물결', '소용돌이', '파도', '해류', '푸른', '신비한'
        ]

        self.nouns = [
            '파이리', '꼬부기', '피카츄', '라이츄', '버터플', '이상해씨', '리자몽',
            '거북왕','캐터피','독침붕','피죤','꼬렛','구구','깨비드릴조','아보','모래두지', '고지','니드퀸',
            '니드킹','식스테일','나인테일','픽시','삐삐','주뱃','푸린','뚜벅쵸','디그다','고라파덕','성원숭','발챙이','슈륙챙이',
            '케이시','윤겔라','알통몬','우츠동','모다피','왕눈해','꼬마돌','롱스톤','야돈','코일','파오리','두두','쥬쥬','질퍽이',
            '파르셀','고오스','팬텀','슬리퍼','크랩','킹크랩','찌리리공','붐볼','아라리','나시','탕구리','홍수몬','시라소몬',
            '내루미','또가스','코뿌리','럭키','쏘드라','콘치','별가사리','아쿠스타','마임맨','스라크','루주라',
            '마그마','잉어킹','갸라도스','라프라스','메타몽','이브이','쥬피썬더', '폴리곤', '부스터',
            '투구푸스', '프테라', '잠만보', '프리져', '썬더','미뇽','망나뇽','뮤츠','뮤','치코리타',
            '토게피','세레비','칠색조', '뿔카노','에레브','쁘사이저','켄타로스','샤미드','암나이트','신뇽','질뻐기',
        ]

    def create(self):
        adjective = random.choice(self.adjectives)
        noun = random.choice(self.nouns)

        return f"{adjective} {noun}"